Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo
An interface for model information in the cloud.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo.ModelId
Model cloud identifier

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo.Name
Gets the name of the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo.ModelSchemaVersion
Gets the schema version of the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo.ModelType
Gets the type of the model, e.g., structural.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo.ModelOwnerId
Gets the userId of the model's owner.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo.ModelTags
Gets the tags associated with the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo.ModelMetadata
Gets the custom properties and additional information related with the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo.ModelCreatedAt
Gets the model creation timestamp

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo.ModelCreatedBy
Gets the display name of the user who created the model

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo.ModelUpdatedAt
Gets the timestamp of the last update on the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo.ModelUpdatedBy
Gets the display name of the user who last updated the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo.Region
Gets the region where the Cloud Model is stored